import random
import string


# Задание № 1   ************************************************************
print(f'\nЗадание № 1 ****************************************\n')

num = input('Введите трехзначное число - ')

num_1 = int(num[0]) + int(num[1]) + int(num[2])
num_2 = int(num[0]) * int(num[1]) * int(num[2])

print(f'Сумма = {num_1},\nПроизведение = {num_2}')


# Задание № 2   ************************************************************
print(f'\nЗадание № 2 ****************************************\n')

a = 5
b = 6
print(bin(5), bin(6))
# получаемые результаты зависят от принципа сложения 1 и 0 для разных
# логических операций. Для оператора &  101 и для |  101
#                                       110          110
#                                       ---          ---
#                                       100          111
print(f'100 в битах = {0b100}')
c = a & b
d = a | b
e = a ^ b
f = ~ a
# также получается и  для побитового сдвига где убираются или
# прибавляются разряды двоичного числа
right = a >> 2
left = a << 2
print(f'{c = }, {d = }, {e = }, {f = }')
print(f'{right = }, {left = }')


# Задание № 3   ***********************************************************
print(f'\nЗадание № 3 ****************************************\n')

x1 = int(input('Введите х - '))
y1 = int(input('Введите у - '))
k = 2

sign = ''
num = ((-x1 * k) + y1)
if num > 0:
    sign = '+'

print(f'y = {k}x{sign}{((-x1 * k) + y1)}')


# Задание № 4   ***********************************************************
print(f'\nЗадание № 4 ****************************************\n')

sign_1 = input('Введите диапазон через пробел - ')
sign_1 = sign_1.split()

if sign_1[0].isdigit():
    print(random.randint(int(sign_1[0]), int(sign_1[1])))
elif '.' in sign_1[0]:
    print(round(random.uniform(float(sign_1[0]), float(sign_1[1])), 2))
elif sign_1[0].isalpha():
    print(chr(random.randint(ord(sign_1[0]), ord(sign_1[1]))))


# Задание № 5   ***********************************************************
print(f'\nЗадание № 5 ****************************************\n')

letter_1 = input('Введите первую букву - ')
letter_2 = input('Введите вторую букву - ')

let = string.ascii_lowercase

num_1 = let.find(letter_1) + 1
num_2 = let.find(letter_2) + 1
print(f'{letter_1} - {num_1}, {letter_2} - {num_2}')
print(f'{(num_2 - num_1) - 1} букы между введенными')


# Задание № 6   ***********************************************************
print(f'\nЗадание № 6 ****************************************\n')

num_let = input('Введите номер буквы')

let_list = list(string.ascii_lowercase)
print(f'Под номером {num_let} буква {let_list[int(num_let) - 1]}')


# Задание № 7   ***********************************************************
print(f'\nЗадание № 7 ****************************************\n')

a = int(input('Сторона А - '))
b = int(input('Сторона В - '))
c = int(input('Сторона С - '))

if a + b > c and b + c > a and c + a > b:
    if a == b != c or b == c != a or c == a != b:
        print('Треугольник существует и он является равнобедренным')
    elif a == b == c:
        print('Треугольник существует и он является равносторонним')
    else:
        print('Треугольник существует и он является разносторонним')
else:
    print('Такой трейгольник не может существовать')


# Задание № 8   ***********************************************************
print(f'\nЗадание № 8 ****************************************\n')

year = input('Введите год - ')

if year[2: 4] != '00' and int(year) % 4 == 0:
    print('Год високосный')
elif year[2: 4] == '00' and int(year) % 400 == 0:
    print('Год високосный')
else:
    print('Год не високосный')


# Задание № 9   ***********************************************************
print(f'\nЗадание № 9 ****************************************\n')

num_1 = int(input('Введите число - '))
num_2 = int(input('Введите число - '))
num_3 = int(input('Введите число - '))

value = list()
value.append(num_1)
value.append(num_2)
value.append(num_3)
value.sort()

print(f'средним является число {value[1]}')
